am/OpenFOAM-10/tutorials/multiphase/multiphaseEulerFoam/laminar/steamInjection/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

massSource
{
    type            massSource;

    selectionMode   points;
    points
    (
        (0.075 0.2 0.05)
    );

    phase           steam;
    rho             thermo:rho.steam;

    massFlowRate
    {
        type            scale;
        scale           squarePulse;
        start           1;
        duration        1e6;
        value           1e-3;
    }

    fieldValues
    {
        U.steam         (0 10 0);
        h.steam         3700000;
    }
}


// ************************************************************************* //
